UT_11_4.OnlineStore/src/ExchangePlans/OS_ОбменСИнтернетМагазином/OS_ОбменСИнтернетМагазином.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="4f750433-4d8c-402f-81da-5bed647634f3">
  <name>OS_ОбменСИнтернетМагазином</name>
  <attributes>
    <name>ИспользоватьОбменСИнтернетМагазином</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаПартнера</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

UT_11_4.OnlineStore/src/ExchangePlans/OS_ОбменСИнтернетМагазином/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверкаПодключения(Команда)
	
	Если ПроверкаПодключенияВыполняется() Тогда
		ПоказатьПредупреждение(, "Проверка выполнена успешно");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьОбменСИнтернетМагазиномПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Если Форма.Объект.ЭтотУзел Тогда
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Форма.Элементы.НастройкиПодключения.ТолькоПросмотр = Не Форма.Объект.ИспользоватьОбменСИнтернетМагазином;
	Форма.Элементы.ПроверкаПодключения.Доступность = Форма.Объект.ИспользоватьОбменСИнтернетМагазином;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаПодключенияВыполняется()
	
	ПодключениеДоступно = Ложь;
	
	ПараметрыУзла = Новый Структура;
	ПараметрыУзла.Вставить("УзелОбмена", Объект.Ссылка);
	ПараметрыУзла.Вставить("ИспользоватьОбмен", Объект.ИспользоватьОбменСИнтернетМагазином);
	ПараметрыУзла.Вставить("СтрокаПодключения", Объект.СтрокаПодключения);
	ПараметрыУзла.Вставить("КлючДоступа", Объект.КлючДоступа);
	
	OS_ОбменСИнтернетМагазином.ПроверитьПодключение(ПодключениеДоступно, ПараметрыУзла);
	
	Возврат ПодключениеДоступно;
	
КонецФункции

#КонецОбласти
